package com.qtech.cleverfarmer.CustomView;

/**
 * Created by xiaobailong24 on 2016/5/13.
 * Class:
 * Describe:
 * Version:
 */
public interface SpinnerAdapter {


    //市级选项值
    public String[] str_spinner1 = new String[]{"威海市"};
    //县级选项值
    public String[][] str_spinner2 = new String[][]
            {//威海市
                    {"荣成市", "乳山市 ", "环翠区", "文登区"}
            };

    //乡镇级选项值
    public String[][][] str_spinner3 = new String[][][]
            {
                    //威海
                    {  //威海市荣成市 18
                            {"港西镇", "埠柳镇", "俚岛镇", "成山镇", "崖头镇", "夏庄镇", "崖西镇", "荫子镇",
                                    "大疃镇", "滕家镇", "王连街道", "上庄镇", "虎山镇", "斥山街道", "东山街道",
                                    "宁津街道", "人和镇", "崖头"},
                            //威海市乳山市 15
                            {"城区街道", "下初镇", "午极镇", "白沙滩镇", "冯家镇", "夏村镇", "大孤山镇",
                                    "乳山寨镇", "乳山口镇", "南黄镇", "海阳所镇", "徐家镇", "诸往镇", "崖子镇",
                                    "育黎镇"},
                            //威海市环翠区 13
                            {"泊于镇", "草庙子镇", "初村镇", "崮山镇", "皇冠街道", "桥头镇", "孙家疃镇",
                                    "温泉镇", "西苑街道", "羊亭镇", "张村镇", "汪疃镇", "苘山镇"},
                            //威海市文登区 16
                            {"天福路街道办事处", "环山路街道办事处", "龙山路街道办事处", "小观镇", "泽头镇",
                                    "葛家镇", "米山镇", "宋村镇", "张家产镇", "侯家镇", "泽库镇",
                                    "高村镇", "大水泊镇", "文登营镇", "界石镇", "埠口港管委会"}

                    }
            };


    //村级选项值
    public String[][][][] str_spinner4 = new String[][][][]
            {
                    //威海
                    {    //威海市荣成市
                            {    //港西镇
                                    {"北港西村", "旭口村", "龙家村", "王官庄村", "东星日村", "马格村", "山后鞠家村", "芹夼村", "港山后村"},
                                    //埠柳镇
                                    {"南港西村", "沙楼庄村", "学福村", "杜家村", "孔家村", "万家河村", "黄沟村", "邹家村", "小梁家村", "现都村", "河西车家村", "坎地村", "营洛村", "东姚家山村", "汉章泊村", "东张格村", "北兰格村", "东下庄村", "凤头村", "南兰格村", "西初家村", "梁南庄村", "西豆山村", "汤家村", "黄沟村", "邹家村", "石桥村", "不夜村", "车古村", "大梁家村"},
                                    //俚岛镇
                                    {"杏北台村", "杏石硼子村", "小泊村", "后神堂口村", "烟墩角村", "白云东村", "金角口村", "北马道河村", "燕泊村", "香山前村", "西庙院村", "杏陈家村", "西林村", "沟崖张家村", "西利查埠村", "王家山村", "东庄村", "大疃林家村", "东烟墩村", "北我岛村", "小耩村", "庄上宋家村", "大疃李家村", "山后王家村", "前神堂口村", "东庙院村", "石山东村", "小疃林家村", "大庄许家村", "项家寨村", "金角港村", "卧龙王家村", "北花园村", "刘家圈村", "大苏家村", "桥子沟村", "陈冯庄村"},
                                    //成山镇
                                    {"北曲格村", "岳家庄村", "墩东夼村", "西北泊村", "黄埠村", "窑上村", "黄埠山前村", "北郑家村", "宫家庄村", "石水河西村", "北盐滩村", "车祝沟村", "马山寨村", "沙沟村", "蒲家泊村", "大石家泊村", "马家疃村", "泊南崖村", "马山大疃村", "南泊子村", "沟黄家村", "沟刘家村", "岳家庄村", "南曲格村", "康村", "成山六村", "小岗南头村", "冯家庄村", "蒲家泊村", "礼村", "马山寨村", "马山蔡家村", "秦格村"},
                                    //崖头镇
                                    {"福台山村", "西北山村", "赵家村", "堡子后村", "西兰家庄村", "福禄山村", "丛家泊村", "垛山姜家村", "河西村", "河崖村", "坦埠庄村", "八甲村", "河西王家村", "大岳家村", "不落耩村", "水门口村", "夼北村", "河北隋家村", "张家村", "马安屯村", "耩上宋家村", "东迎驾山村", "夼子河村", "石猴子村", "北吴家村", "菜园村", "嘉渔汪村", "樊家庄村", "蔡家庄村", "向阳埠村", "大迟家村", "河南村", "中埠村", "北埠村", "阎家庄村", "地宝圈村", "宁家村", "崂山屯村", "柳家庄村", "脉埠村", "烟墩耩村", "西牢村", "亮甲沟村", "青安屯村", "棘子埠村", "山马家村", "杨官屯村", "沽泊闫家村", "河南村", "后龙河村", "后沟村", "刁家沟村", "后密文村", "前虎口村", "牛口石村", "寻山所村", "鲍家庄村", "斜口岛村", "东庄村", "毕家屯村", "神道村"},
                                    //夏庄镇
                                    {"大河东村", "河北崖村", "大胪村", "江林庄村", "哈山村", "马安埠村", "同家庄村", "前寨村", "甲夼马家村", "甲夼王家村", "前苏格村", "寨子耩村", "青埠岭后村", "雷家庄村", "大夏庄村", "甲夼曲家村", "兴隆村", "上郭家村"},
                                    //崖西镇
                                    {"上庄村", "小山口村", "车家庄村", "北柳村", "前庵村", "西柳村", "朱家夼村", "西双顶村", "桥南头村", "戴家庵村", "潘家沟村", "卧龙戴家村", "东埠前村", "前高家庄村", "小蒿泊村", "山河吕家村", "于家台村", "北苑庄村", "小刘家村", "上庄村", "北崖西村", "朱埠村", "东双顶村", " 林道沟村", "后庵村", "万马庄村", "詹家庄村", "南崖西村", "西埠前村", "西藏村", "北岔河崖村"},
                                    //荫子镇
                                    {"土城子村", "后荫子夼村", "东夏埠村", "西夏埠村", "店子泊村", "韩家地村", "于家泊村", "耩 上姚家村", "王管松村", "前荫子夼村", "北流水村", "耩上岳家村", "马台柯家村", "立驾山村", "姜家泊村", "前青顶村", "雨夼沟村", "耩后张家村", "兰村", "家堂村", "塘子崖村", "陈家埠村"},
                                    //大疃镇
                                    {"孤石杜家村", "东沟南疃村", "小卧龙村", "大卧龙村", "窑西耩村", "邹山东村", "洛庄村", "后 头村", "北石耩村", "岳泊庄村", "迟家店村", "小泥沟村", "北湾头村", "南湾头村", "姜家屯村", "北旺庄村", "东岭长村", "小珠玑村", "东徐家村", "双石周家村", "户山屯村", "西中窑村", "徐 田庄村"},
                                    //滕家镇
                                    {"鲍村", "马草夼村", "大落村", "东滩郭家村", "滕家村", "东耩村", "单家村", "不落岛村", "高落山村", "李家屯村", "于家庄村", "西寺村", "康家村", "曲家沟村", "打铁孙家村", "五章村", "三 章村", "花园村", "观前泊村", "西初家村", "草卜屯村", "西仙王家村", "东仙王家村"},
                                    //王连街道
                                    {"赵家山村", "刘家庄村", "西慕家村", "东岛刘家村", "松顶后村", "北桥头村", "马岭许家村", " 寨前峨石村", "店子村", "大汛姜家村", "东岛刘家村", "客岭村", "南桥头村", "阴亮村"},
                                    //上庄镇
                                    {"刁家村", "小龙庄村", "西旗杆石村", "东旗杆石村", "王管庄村", "邢格庄村", "东桥村", "西桥 村", "庙东武家村", "梁家庄村", "帽刘家村", "北沙岛村", "刘家店村", "尹家村", "院前村", "原 家村", "东上庄村", "大李家村", "涝村孙家村", "吕家疃村", "邢格庄村", "蔡官屯村", "东古章村", "铺里村", "王皮庄村", "口子后村", "东涝村", "北也子口村"},
                                    //虎山镇
                                    {"庵里村", "东峰山后村", "得胜寨村", "董家屯村", "正寺村", "谭家村", "西塘子村", "大龙嘴村", "孙家庄村", "伯家村", "黄山王家村", "东双庙村", "福落山村", "桥头庄村", "史家泊村", "南寨子后村", "小店村", "西峰山后村", "黄山村", "峰山前村", "岛宋家村", "鹊岛村", "罕山村", "长 湾村", "岳家村", "五龙嘴村", "胡家村", "大曲家村", "梁家村", "南于家村"},
                                    //斥山街道
                                    {"盛家村", "西泊子村", "郭家村", "南庙山村", "夏家泊村", "高家齐山村", "尹格庄村", "殷家村", "沟姜家村", "吴家村", "大磨张家村", "北窑村"},
                                    //东山街道
                                    {"东窑村", "谭村林家村", "龙山后村", "八里王家村", "东山村", "八河王家村", "万马邢家村", " 青山前村", "石头河村", "港西崖村", "甲子山村", "沟王家村", "石头河村", "崮山前村", "八河毕家村", "西夏家村", "吉屯村"},
                                    //宁津街道
                                    {"龙泉村", "后店子村", "龙云村", "所后卢家村", "林家流村", "止马滩村", "东钱家村", "曲家村", "东墩村", "岛西庄村", "鞠家村", "季家村", "南港头村", "西南海村", "苑家村", "留村", "马家 寨村", "褚岛村", "后海崖村", "金庄村", "南泊村", "南港头村", "口子村", "山前村"},
                                    //人和镇
                                    {"北卧龙村", "昌邑村", "大庄村", "丁家庄村", "东北河村", "东刘家疃村", "二道港村", "古楼村", "韩家疃村", "何家村", "金沟村", "靖海卫村", "老军屯村", "路家庄村", "南齐山村", "南卧龙村", "南下河村", "蟠龙石村", "人和村", "山西头村", "宋家竹村", "宋家庄村", "孙家夼村", "万家疃村", "西河口村", "西黄埠岭村", "西老树河村", "西邵家山村", "邢家村", "许家屯村", "晏家庄村", "寨前村"},
                                    //崖头
                                    {"雨夼村"}
                            },

                            //威海市乳山市
                            {    //城区街道
                                    {"桥东庄村", "高格庄村", "北江村", "洼九埠村", "石村"},
                                    //下初镇
                                    {"西马台石村", "巫山村", "单家疃村", "初家沟村", "古初村", "里庄村", "辛庄村", "黄格庄村", "南东庄村", "下草埠村", "日照庄村", "辛家疃村", "西泊村", "簸簯掌村", "北东庄村", "北芦头村", "英格庄村", "葛格庄村", "东马台石村", "巫山村", "西庄村", "河南村", "车家夼村", "垒中前 村", "簸箕掌村", "葛格庄村", "上初村", "辛家疃村", "史家疃村", "黄格庄村", "胡家口村", "下 初村", "山南头村", "下草埠村", "耩南头村", "下洼村"},
                                    //午极镇
                                    {"北庄村", "车道村", "樗树崖村", "大虎岚村", "辉沾", "卢家村", "鲁家夼村", "马家夼村", "曲家屯村", "上万口村", "石字岘村", "宋庄村", "孙家疃村", "唐家沟村", "土心头村", "西巷村", "下 万口村", "湘沟村", "小虎岚村", "小寨村", "杨家庄村", "由家庄村", "于家庄", "于家庄村", "于 庄村", "泽上村", "张家屯村", "正甲夼村", "中庄村"},
                                    //白沙滩镇
                                    {"孔家庄村", "堡上村", "北王家庄村", "翁家埠村", "港头村", "桃村李家村", "南马家庄村", "念头村", "焉家村", "南西北庄村", "吉林村", "玉前庄村", "林家塂村", "大单家村", "潘家村", "西北庄村", "常家庄村", "八甲村", "潘家庄村", "白沙滩村", "翁家埠村", "六村屯村", "蔡 家村", "稗子刘家村"},
                                    //冯家镇
                                    {"南刘伶庄村", "东官庄村", "东马家庄村", "高家台村", "砦里村", "东吉子园村", "南高格庄村", "鲁家村", "南寨村", "盘石村", "北高格庄 村", "北汉村", "马山前村", "吕格庄村", "冯家村", "消水河村", "山北头村", "后疃村", "东疃村", "花家疃村", "北刘伶庄村", "汤东疃村", "汤后疃村", "北泥沟", "瑞木山", "万家", "孔家", "店子村", "南寨村", "肖水河村", "北高格庄村", "合子庄村", "北寨村", "盘石村", "徐家村", "吴格庄村", "合子村", "孔家村", "上口村", "中寨村", "马山沟村", "观上冯家村", "冯家村", "葛口村", "瑞木山村", "汤后疃村", "卧龙村", "石城村", "马家泊子村"},
                                    //夏村镇
                                    {"崔家村", "六甲庄村", "朱家庄村", "二甲村", "东秦家庄村", "战家夼村", "房屋村", "西圈村", "林水村", "羊角盘村", "西泗水头村", "东周格庄村", "任沟村", "石头圈村", "东家村", "台依村", "肖家村", "东泗水头村", "井子村", "炉上村", "郑家村", "井子村 ", "小疃村", "清口 涧村", "官庄村", "于家庄村", "埠西庄村", "胡家沟村", "十甲庄村", "东秦家庄村", "大王口村", "西北庄村", "马家庄村", "黄村"},
                                    //大孤山镇
                                    {"八门邹家村", "下石灰刘家村", "大史家村", "丛家村", "东林家村", "山西头村", "上石灰刘家村", "吴家沟村", "西林家村", "宫家村", "李 家庄村", "胡家村", "八里甸村", "水井村", "石硼杨家村", "入夼村", "仕于家村", "上刘家村", "山东头村", "北念头村", "店子头村", "大孤 山村", "河东村", "小孤山村", "赵家村", "果园村", "上夼村", "果园村", "小史家村", "林家庄村", "万户村", "南口村"},
                                    //乳山寨镇
                                    {"玉皇台村", "横山后村", "刁家村", "管村", "李家兴村", "石硼崔家村", "西驾马沟村", "果枣夼村", "圈港村", "玉皇山后村", "人石村", "芦根滩村", "寨西村", "崔家沟村", "高家兴村", "杨家村", "官村", "丰台顶村", "南司马庄村", "腾家河村", "乳山屯", "东司马庄", "果枣奇", "寨中", "玉皇台", "仇家兴", "南司马庄村", "宝口村", "东驾马沟村", "仇家兴村", "北司马庄村", "车村", "玉皇山后村", "芦根滩村", "车村", "到根见村", "滩甲庄村"},
                                    //乳山口镇
                                    {"西南赵家村", "新建村", "寨前村", "新庄村", "河口村", "南唐家村", "长疃村", "锅上村", "庄头村", "改造夼村", "安家村", "刁家港村", " 毛家村", "康家村", "后尹家村", "江村洼", "刘家庄村", "秦家庄村", "兰家村", "封增山村", "北唐家村", "兰家庄村", "安家村", "西南赵家 村"},
                                    //南黄镇
                                    {"院后村", "宫家疃村", "仙人脚村", "庄子园村", "西浪暖村", "湾头村", "李家疃村", "东洋水村", "南黄庄村", "南黄村", "岭上村", "西洋水村", "北斜山", "柯家庄", "西珠塂村", "靠山村", "北塂村", "汤南山村", "宫家庄村", "西浪暖村", "陈家屯村", "柯家庄村", "高家屯村", "南黄村", "岭上村", "冷家村", "宫家疃村", "归仁村", "崮山寺村"},
                                    //海阳所镇
                                    {"望海庄村", "西泓赵家村", "西山村", "西黄岛村", "后山于家村", "南泓南村", "南夼村", "杜家村", "薛格庄村", "海阳所村", "陈家村", "常家庄村", "海疃村", "三甲村", "池源村", "水头村", "东庄村", "赵家村", "金港村", "薛格村", "南宏北村", "南宏南村", "小石口村", "邹格村", "双峰庄村", "金港村", "赵家庄村", "杜家岛村", "水头村", "李家村", "姜格村", "南夼村", "小泓村", "半海山村", "大庄村", "常家庄村",},
                                    //徐家镇
                                    {"东峒岭村", "车门口村", "西峒岭村", "东南耩村", "四甲村", "大浩口村", "杨家屯村", "许家屯村", "邢家屯村", "圣石前村", "东刘家庄村", "桑杭村", "东门口村", "王家庄", "洋村村", "东南耩村", "辛家口村", "东南耩村", "徐家村", "杨家屯村", "马场村", "东南寨村"},
                                    //诸往镇
                                    {"凤凰台村", "下石硼村", "中尚山村", "青石楼村", "沟西村", "招民庄村", "东诸往村", "孙家夼村", "燕山泊村", "垛疃村", "野房村", "前夼村", "神头庙村", "光明村", "泊子村", "唐家村", "安夼村", "姜格庄村", "扫帚涧村", "大院村", "王家疃村", "口子村", "李格庄村", "西辛庄头村", "大龙口村", "西诸往村", "铁山村", "前夼村", "于家圈村", "冷格庄村", "许家村", "上石硼村", "王家庄村", "流水头村", "姜格庄村", "许家村", "铁山村", "大龙口村", "中尚山村", "孙家夼村", "马 陵村", "垛疃村", "神童庙村", "田家庄村", "铁山村"},
                                    //崖子镇
                                    {"西崮头村", "张格庄村", "崖子村", "南马石村", "枣林村", "泊乔家村", "马石店村", "转山头村", "北占寨村", "山下村", "北果子村", "南地口村", "西古头村", "申家村", "山西村", "史家村", "下沙家村", "东涝口村", "西凤凰崖村", "草庵村", "河南村", "泽科村", "石甲庄村", "大古头村", "山东村", "上肖家村", "阎家夼村", "河南钟家村", "西凤皇崖村", "东南村", "枣林村", "炉上村", "东夼村", "上沙家村 ", "西井口村", "田家村", "崖子村", "万格庄村", "北地口村", "河北村 ", "南果子村", "东凤凰崖村", "西涝口村", "转山头村", "南寨村", "康家夼村", "南马石村", "台上村", "马石店村", "青山村", "南果子村", "姜家夼村"},
                                    //育黎镇
                                    {"东由古村", "老由古村", "西横道口村", "马庄村", "曲水村", "下宋格庄村", "白石村", "宅子夼村", "南北山村", "南西屋村", "曹家村", "鲁济村", "南勇家村", "北勇家村", "西纪村", "汪水村", "帽张家村", "山后村", "西横道口", "东纪村", "南北山村", "南李家村", "邓家村", "孙家沟村", "于家村", "龙角山村", "塔庄村", "汪水村", "南勇家村", "南西屋村", "北西屋村", "北勇家村", "城阴村", "西屋南夼村"}
                            },

                            //威海市环翠区
                            {    //泊于镇
                                    {"白马北村", "鲍家村", "大邓格村", "岛邓家村", "崮庄村", "刘官屯村", "栾家滩村", "圈邓家村", "松徐家村", "屯钟家村", "温泉寨村", "夏庄村", "盐滩村", "泊于家村", "大林格村", "官庄村", "海头院村", "海西头村", "金鸡山后村", "蒲湾村", "松郭家村", "小林格村"},
                                    //草庙子镇
                                    {"大东疃村", "大木岚村", "郭家庄村", "蒋家庄村", "上庄村", "隋家疃村", "西黄山村", "西李家村", "下庄村", "向阳村", "张家疃村", "北大疃村", "北黄山村", "北台村", "毕家庄村", "曹格庄村", "丛家屯村", "打铁村", "大东疃村", "大木岚村", "大庄村", "东李家村", "东宋家村", "垛岭村", "郭家庄村", "郝家山村", "林泉村", "南大疃村", "南郭格村", "南黄山村", "泉东村", "周家庄村"},
                                    //初村镇
                                    {"长夼村", "长夼店村", "东石岭村", "纪家口子村", "莱山村", "马石泊村", "四甲村", "西车门村", "小产村", "小馆村", "朱家寨村", "岛子前村", "佃里院村", "东车门村", "东马山村", "东南村", "河北村", "龙口庵村", "西北村", "西北道村", "西石岭村", "小馆村", "远庄村"},
                                    //崮山镇
                                    {"艾于庄村", "鲍家山村", "北虎口村", "陈家庄村", "河东村", "刘家滩村", "柳家庄村", "邵家庄村", "西村", "中村", "北虎口村", "九家疃村", "南虎口村", "沙龙王家村", "所前庄村", "西村", "张家滩村"},
                                    //皇冠街道
                                    {"海埠村"},
                                    //桥头镇
                                    {"报信村", "碑鲁村", "北墩前村", "北子城村", "埠上村", "柴里村", "产里村", "大院村", "大贞村", "邓家店村", "东涧村", "东龙山村", "东 洛后村", "东于家村", "董家夼村", "方吉村", "福禄庄村", "观里东村", "观里西村", "河西庄村", "后于家村", "后宅库村", "黄金庄村", "涧 北村", "江家口村", "教里村", "刘家泊村", "洛西村", "马井泊村", "孟家庄村", "南台村", "南子城村", "盘川夼村", "彭家埠村", "前宅库村", "桥头村", "宋家店村", "所前泊村", "西龙山村", "西洛后村", "西山后村", "西于家村", "西贞村", "新建村", "信河北村", "徐家庄村", "雅 格庄村", "姚家圈村", "义河北村", "中于家村", "碑鲁村", "东洛后村", "观里东村", "江家口村", "西于家村"},
                                    //孙家疃镇
                                    {"远遥村"},
                                    //温泉镇
                                    {"东崮村", "罗家村", "前亭子村", "双寺村", "温泉汤村", "小南山村", "小庄村", "雨夼村", "郑家村", "东七夼村", "河西村", "柳林村", "栾 家店村", "堂子村", "温泉汤村", "西七夼村", "张家山村"},
                                    //西苑街道
                                    {"北七夼村", "东山口村", "高家庄村", "牛角沟村", "五家疃村", "西庄村", "徐家疃村", "闫家庄村", "岳家庄村", "竹园村", "北葛拉村", "南葛拉村", "西庄村", "岳家庄村"},
                                    //羊亭镇
                                    {"北江疃村", "北郊村", "北上夼村", "北小城村", "贝草夼村", "店上村", "港头村", "鲁东村", "南郊村", "南小城村", "孙家滩村", "小城庄村", "羊亭村", "义和村", "于家夼村", "朱家圈村", " 廒上村", "半壁山村", "埠前村", "港头村", "鹿道口村", "梅家沟村", "阮家口村", "上炉 村", "王家夼村", "卧龙村", "于家夼村"},
                                    //张村镇
                                    {"东夼村", "东莱海村", "后双岛村", "姜家疃村", "刘家疃村", "前双岛村", "王家疃村", "西莱海村", "东夼村", "东莱海村", "福德庄村", "后双岛村", "姜家疃村", "姜南庄村", "王家疃村", "西山村"},
                                    //汪疃镇
                                    {"丛家产村", "许家屯村", "吐羊口村", "上韩家村", "后白鹿村", "东黄埠村", "汪疃村", "地文头村", "西梁格村", "翠峡口村", "韩西庄村", "三家庄村", "殷家卧龙村", "白鹿屯村", "于家英村", "小屯村", "上夼村", "曹家泊子村", "孙家沟村", "柏家庄村", "沈家荒村", "石家泊村", "桑杭埠村", "下韩家村", "前白鹿村", "段家庄村", "白鹿店子村", "大宅库村", "东三庄村", "柏家庄村", "东英武村", "汪疃村", "王家产村"},
                                    //苘山镇
                                    {"白玉庄村", "北刘章村", "北申格村", "大草场村", "大夼村", "丁家埠村", "丁家洼村", "东高格村", "东黄岚村", "东柳村", "东马格村", "东苘山村", "东许家村", "东杨格庄村", "二武林村", "胡家西村", "廿里铺村", "裴家泊子村", "山马刘村", "山马头村", "山马于村", "山马邹村", "汪格庄村", "汶口村", "西床村", "西道头村", "西管山村", "西刘章村", "西马格村", "西武林村", "西杨格庄村", "小黄村", "新权村", "杨家卧龙村"}
                            },

                            //威海市文登区
                            {//天福路街道办事处
                                    {"北磨山村", "五里庄村", "南潘家夼村", "西渠格村", "东藕湾村"},
                                    //环山路街道办事处
                                    {"小嵛岭村", "帽埠耩村", "麦疃后村", "翟格庄村", "口子后村", "孙家西山村", "西坑村", "麦疃后村", "宋家沟村"},
                                    //龙山路街道办事处
                                    {"沙子村", "金岭屯村", "西汤后村", "王埠庄村", "东杨格村"},
                                    //小观镇
                                    {"北黄村", "波罗岛村", "才院村", "东里岛村", "二王家村", "风口集村", "金花村", "郐家村", "垒子北耩村", "庙东村", "南七口村", "裴家岛村", "生家埠村", "孙家寨村", "坦埠村", "万家口村", "万家寨村", "吴家庄村", "西店子村", "西里岛村", "西瓦砌埠村", "小观村", "小芦头村", "徐埠头村", "徐家庄村", "榆树底村", "朱家庄村", "紫草泊村"},
                                    //泽头镇
                                    {"泽头村", "雨夼村", "于家河村", "杨家疃村", "许家埠村", "小宋家村", "小埠村", "下泊子村", "吴官屯村", "望岛村", "上泊子村", "平埠庄村", "倪家庄村", "南桥村", "眠虎岭村", "林村", "里岛村", "孔格村", "黄家庄村", "虎口山村", "高家庄村", "峰山村", "东望仙庄村", "东团岚埠村", "东程格村", "道口村", "岛集村", "大宋家村", "崔家庄村", "埠子场村", "北庄村", "北桥村"},
                                    //葛家镇
                                    {"岔河村", "池水头村", "迟家庄村", "赤金泊村", "东崔家口村", "东宋格村", "东谭家口村", "东于疃村", "葛家村", "韩家庄村", "杭格庄村", "黄龙岘村", "姜新庄村", "林子西村", "刘格庄村", "刘家上口村", "南石山头村", "南于疃村", "南长岚村", "铺集村", "山北头村", "生格庄村", "旺格庄村", "西崔家口村", "西旺疃村", "下卧龙村", "小英村", "姚家庄村", "议城村", "英山前村", "于家口村", "院西村", "占甲埠村", "中旺疃村", "周家埠村", "祝家泊子村"},
                                    //米山镇
                                    {"草场村", "大山前村", "东山后村", "东石硼村", "东下庄村", "垛夼村", "范家屯村", "佛东夼村", "郭格庄村", "横口村", "姜格村", "耩南庄村", "老埠村", "南古场村", "南崮头村", "南郑格庄村", "曲家庵村", "山西头村", "西石硼村", "西下庄村", "小耩村", "新发庄村", "新上庄村", "鸭子夼村", "长山村"},
                                    //宋村镇
                                    {"北马村", "鹁鸽崖村", "草埠村", "大床村", "大泽头村", "大寨村", "郭家店村", "河格庄村", "集西村", "姜家庄村", "耩上村", "李仙庄村", "南马村", "潘格庄村", "青岭村", "曲疃庄村", "山东村", "上徐村", "神格庄村", "石灰窑村", "石羊村", "双石村", "寺前村", "宋村", "宋疃庄村", "西海庄村", "西马村", "下徐村", "硝一村", "徐格庄村", "姚山头村", "郑家沟村", "周格庄村", "紫金山村"},
                                    //张家产镇
                                    {"西水道村", "告驾口村", "安子泊村", "车卧岛村", "汤村店子村", "因寺桥村", "林家床村", "山后侯家村", "东官道村", "大永福村", "庙山姜家村", "口子李村", "南圈村", "文石山村", "登登口村", "杏林庄村", "麾艮村", "东圈村", "因寺桥村", "石羊口村", "东水道村", "永福孙家村", "大旺庄村", "顾家村", "邹家床村", "北初家庄村", "南汤村"},
                                    //侯家镇
                                    {"北廒村", "东泥沟村", "河杨家村", "崔家村", "朱家村", "大百户村", "南学村", "南廒村", "张家庄村", "南寨村", "南渠格村", "上郭家村", "侯家村", "江山泊村", "小洛村", "二马村", "高家村", "集后村", "山前村", "北石韩家村", "大时家村", "马家夼村", "吴家滩村", "二马村", "西廒村", "石章河村", "时家滩村", "潘家村", "东廒村"},
                                    //泽库镇
                                    {"长会口村", "寨前村", "尹家村", "姚家村", "辛旺庄村", "辛立庄村", "小葛家村", "西泊村", "滩西头村", "前岛村", "南辛庄村", "南台村", "南岭村", "刘家村", "花岛村", "后岛村", "港南村", "慈家滩村"},
                                    //高村镇
                                    {"北产村", "北腾圈村", "北邢家村", "慈口观村", "殿山院村", "墩后村", "凤台顶后村", "高村", "韩家村", "后泊村", "虎山村", "黄庵村", "金岭村", "靳家店子村", "鞠格庄村", "莲花城村", "岭上董家村", "绿杨村", "脉田村", "庙后王家村", "沙柳村", "汤泊阳村", "汤东村", "汤西村", "唐家咀子村", "望海初家村", "望海倪家村", "西山张家村", "下夼村", "辛店子村"},
                                    //大水泊镇
                                    {"崖下村", "辛庄头村", "歇驾夼村", "下河村", "西邹山村", "西南台村", "囤宋家村", "团山村", "山后孙家村", "荣家店村", "仁河坊村", "青石河村", "前土埠岭村", "埝头村", "马家庄村", "岭上孙家村", "栏杆河村", "后村", "洪家庄村", "河清村", "河东乔家村", "沟曲家村", "方池泊村", "东邹山村", "大台村", "大水泊村", "大河村", "大沟村", "初家村", "迟家河村", "陈驾埠村", "场西村", "埠前头村", "泊岳家村", "泊高家村", "北洼村"},
                                    //文登营镇
                                    {"八里庙村", "宝泉庄村", "埠岚村", "单鲍产村", "邓南庄村", "丁家夼村", "东仓村", "东杜梨村", "东耩村", "沟于家村", "后驾山村", "后长湾村", "驾山窑村", "教场东村", "岭东村", "马格庄村", "马家岭村", "庞家河村", "前北风口村", "前驾山村", "青口岚村", "文登营村", "五岔口村", "西庵后村", "西字城村", "营前村", "于冼庄村", "岳家口村", "张皮村", "榛子崖村", "止马岭村", "中仓村"},
                                    //界石镇
                                    {"张格庄村", "于家村", "旸里店村", "阎家泊子村", "新庄村", "辛上庄村", "西岭西村", "西庵村", "王家庄村", "王家泊子村", "晒字村", "三半石村", "青庄村", "南鲁家埠村", "南截山村", "南店子村", "刘大庄村", "烂木沟村", "岚子后村", "河东村", "蒿耩村", "崮头集村", "大界石村", "大高坎村", "大产村", "楚岘村", "丑家屯村", "北截山村", "北崮头村", "板桥村"},
                                    //埠口港管委会
                                    {"张家埠村", "下冷家村", "下埠前村", "上埠前村", "顶子村", "岙山村"}
                            }
                    }
            };
}
